# Cap 5 - Introdução ao pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import DataFrame, Series

## 5.1 Introdução às estruturas de dados do pandas

### Series

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
# Atributos array e index
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2["a"]

-5

In [12]:
obj2["d"] = 6

In [13]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
"b" in obj2

True

In [18]:
"e" in obj2

False

In [19]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
# Conversão de uma Serie em dicionário
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
# Sobrescrevendo as chaves do dicionário
states = ["California", "Ohio", "Oregon", "Texas"]

In [24]:
obj4 = pd.Series(sdata, index=states)

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
# Funções isna e notna
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
# Atributo name
obj4.name = "population"

In [33]:
obj4.index.name = "states"

In [34]:
obj4

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
# Alterar índice de uma Series por atribuição
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [36]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [37]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [38]:
data = {
    "state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
}
frame = pd.DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
# Método head
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
# Método tail
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [43]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [44]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [45]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [47]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [48]:
# Atributos especiais iloc e loc
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [49]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [50]:
# Modificar colunas por atribuição
frame2["debt"] = 16.5

In [51]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [52]:
frame2["debt"] = np.arange(6.0)

In [53]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [54]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [55]:
frame2["debt"] = val

In [56]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [57]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [58]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

<div style="border-left: 4px solid #ff5555; background: #282a36; color: #f8f8f2; padding: 10px; margin: 10px 0; font-family: sans-serif;">
  <strong>⚠️ Aviso:</strong> 
  Novas colunas não podem ser criadas com a notação de atributo com ponto <code style="background-color: #44475a; color: #f8f8f2; padding: 2px 4px; border-radius: 4px;">frame2.eastern</code>.
</div>

In [59]:
# Método del
del frame2["eastern"]

In [60]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

<div style="border-left: 4px solid #ff5555; background: #282a36; color: #f8f8f2; padding: 10px; margin: 10px 0; font-family: sans-serif;">
  <strong>⚠️ Aviso:</strong>
  A coluna retornada pela indexação de um DataFrame é uma visualização dos dados
  subjacentes e não uma cópia. Logo, qualquer modificação feita diretamente em
  Series será refletida no DataFrame. A coluna pode ser copiada explicitamente
  com o método <code style="background-color: #44475a; color: #f8f8f2; padding: 2px 4px; border-radius: 4px;">copy</code>
  de Series.
</div>

In [61]:
populations = {
    "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
    "Nevada": {2001: 2.4, 2002: 2.9},
}

In [62]:
frame3 = pd.DataFrame(populations)

In [63]:
# Chaves do dicionário mais externo são as colunas e as chaves mais internas
# são os índices das linhas
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [64]:
# Transposição do DataFrame
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

<div style="border-left: 4px solid #ff5555; background: #282a36; color: #f8f8f2; padding: 10px; margin: 10px 0; font-family: sans-serif;">
  <strong>⚠️ Aviso:</strong>
  A transposição descartará os tipos de dados das colunas se estas não tiverem
  o mesmo tipo de dado, logo, fazer transposição e depois desfazê-la pode causar
  perda das informações de tipo anteriores. Nesse caso, as colunas tornam-se arrays
  de objetos Python puros.
</div>

In [65]:
# Sobrescrevendo os índices das chaves mais internas do dicionário
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [66]:
pdata = {"Ohio": frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}

In [67]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [68]:
frame3.index.name = "year"

In [69]:
frame3.columns.name = "state"

In [70]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [71]:
# Método to_numpy
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [72]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Objetos Index

In [73]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [74]:
index = obj.index

In [75]:
index

Index(['a', 'b', 'c'], dtype='object')

In [76]:
index[1:]

Index(['b', 'c'], dtype='object')

In [77]:
index[1] = "d"

TypeError: Index does not support mutable operations

In [ ]:
labels = pd.Index(np.arange(3))

In [ ]:
labels

Index([0, 1, 2], dtype='int32')

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [ ]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [ ]:
obj2.index is labels

True

In [ ]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [ ]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [ ]:
"Ohio" in frame3.columns

True

In [ ]:
2003 in frame3.index

False

In [ ]:
# Ao contrário dos conjuntos Python, um Index do pandas pode conter rótulos
# duplicados
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 5.2 Funcionalidades essenciais

### Reindexação

In [78]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [ ]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [80]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [ ]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [82]:
# parâmetro method
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [ ]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [84]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [85]:
frame = pd.DataFrame(
    np.arange(9).reshape((3, 3)),
    index=["a", "c", "d"],
    columns=["Ohio", "Texas", "California"],
)

In [ ]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [87]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [ ]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [89]:
states = ["Texas", "Utah", "California"]

In [90]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [91]:
# parâmetro axis
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [92]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

### Remoção de entradas de um eixo

In [93]:
# Método drop
obj = pd.Series(np.arange(5.0), index=["a", "b", "c", "d", "e"])

In [ ]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [95]:
new_obj = obj.drop("c")

In [ ]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [97]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [98]:
data = pd.DataFrame(
    np.arange(16).reshape((4, 4)),
    index=["Ohio", "Colorado", "Utah", "New York"],
    columns=["one", "two", "three", "four"],
)

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [102]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [103]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexação, seleção e filtragem

In [104]:
obj = pd.Series(np.arange(4.0), index=["a", "b", "c", "d"])

In [ ]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [106]:
obj["b"]

1.0

In [107]:
obj[1]

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\3621043455.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [108]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [109]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [110]:
obj[[1, 3]]

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\4102577471.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [111]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [112]:
# Operador loc
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [113]:
# Diferença entre indexação com inteiros e o uso do loc
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [116]:
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [117]:
obj1

2    1
0    2
1    3
dtype: int64

In [118]:
obj2

a    1
b    2
c    3
dtype: int64

In [119]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [120]:
obj2[[0, 1, 2]]

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\4078289495.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [121]:
obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int32')] are in the [index]"

In [122]:
# Operador iloc
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [123]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

<div style="border-left: 4px solid #ff5555; background: #282a36; color: #f8f8f2; padding: 10px; margin: 10px 0; font-family: sans-serif;">
  <strong>⚠️ Aviso:</strong>
  O fatiamento com rótulos também pode ser feito, mas ele funcionará diferentemente
  do fatiamento normal do Python por que a extremidade final será incluída.
</div>

In [124]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [125]:
obj2.loc["b":"c"] = 5

In [ ]:
obj2

a    1
b    5
c    5
dtype: int64

In [127]:
data = pd.DataFrame(
    np.arange(16).reshape((4, 4)),
    index=["Ohio", "Colorado", "Utah", "New York"],
    columns=["one", "two", "three", "four"],
)

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [129]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [130]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [131]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [132]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [133]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [134]:
data[data < 5] = 0

In [ ]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Seleção no DataFrame com loc e iloc

In [ ]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [138]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [139]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [140]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [141]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [ ]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [143]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [144]:
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [145]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [146]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Armadilha da indexação com inteiros

In [147]:
ser = pd.Series(np.arange(3.0))

In [ ]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [149]:
ser[-1]

KeyError: -1

In [150]:
ser2 = pd.Series(np.arange(3.0), index=["a", "b", "c"])

In [151]:
ser2[-1]

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\2869701431.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [152]:
ser.iloc[-1]

2.0

In [ ]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### Armadilhas da indexação encadeada

In [155]:
data.loc[:, "one"] = 1

In [ ]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [167]:
data.iloc[2] = 5

In [168]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [169]:
data.loc[data["four"] > 5] = 3

In [170]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [171]:
data.loc[data.three == 5]["three"] = 6

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\4274157261.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

In [ ]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [173]:
data.loc[data.three == 5, "three"] = 6

In [ ]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

### Aritmética e alinhamento de dados

In [175]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [176]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])

In [ ]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [ ]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [179]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [180]:
df1 = pd.DataFrame(
    np.arange(9.0).reshape((3, 3)),
    columns=list("bcd"),
    index=["Ohio", "Texas", "Colorado"],
)

In [181]:
df2 = pd.DataFrame(
    np.arange(12.0).reshape((4, 3)),
    columns=list("bce"),
    index=["Utah", "Ohio", "Texas", "Oregon"],
)

In [ ]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [ ]:
df2

          b     c     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [184]:
df1 + df2

            b     c   d   e
Colorado  NaN   NaN NaN NaN
Ohio      3.0   5.0 NaN NaN
Oregon    NaN   NaN NaN NaN
Texas     9.0  11.0 NaN NaN
Utah      NaN   NaN NaN NaN

In [185]:
df1 = pd.DataFrame({"A": [1, 2]})

In [186]:
df2 = pd.DataFrame({"B": [3, 4]})

In [ ]:
df1

   A
0  1
1  2

In [ ]:
df2

   B
0  3
1  4

In [189]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

#### Métodos aritméticos com valores para preenchimento

In [190]:
df1 = pd.DataFrame(np.arange(12.0).reshape((3, 4)), columns=list("abcd"))

In [191]:
df2 = pd.DataFrame(np.arange(20.0).reshape((4, 5)), columns=list("abcde"))

In [192]:
df2.loc[1, "b"] = np.nan

In [ ]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [ ]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [195]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [196]:
# Método add
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [197]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [198]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [199]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operações entre DataFrame e Series

In [200]:
arr = np.arange(12.0).reshape((3, 4))

In [ ]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [ ]:
arr[0]

array([0., 1., 2., 3.])

In [ ]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [204]:
frame = pd.DataFrame(
    np.arange(12).reshape((4, 3)),
    columns=list("bde"),
    index=["Utah", "Ohio", "Texas", "Oregon"],
)

In [205]:
series = frame.iloc[0]

In [ ]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [ ]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [208]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [209]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [ ]:
series2

b    0
e    1
f    2
dtype: int32

In [211]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [212]:
series3 = frame["d"]

In [ ]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [ ]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [215]:
frame.sub(series3, axis="index")

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### Aplicação de funções e mapeamento

In [216]:
frame = pd.DataFrame(
    np.random.standard_normal((4, 3)),
    columns=list("bde"),
    index=["Utah", "Ohio", "Texas", "Oregon"],
)

In [ ]:
frame

               b         d         e
Utah   -0.772464 -0.890451 -0.831480
Ohio   -0.174682 -1.547119 -0.090476
Texas  -0.379397 -0.038659 -0.404683
Oregon -1.205084 -0.184629  1.207853

In [ ]:
np.abs(frame)

               b         d         e
Utah    0.772464  0.890451  0.831480
Ohio    0.174682  1.547119  0.090476
Texas   0.379397  0.038659  0.404683
Oregon  1.205084  0.184629  1.207853

In [219]:
def f1(x):
    return x.max() - x.min()

In [ ]:
frame.apply(f1)

b    1.030402
d    1.508460
e    2.039333
dtype: float64

In [221]:
frame.apply(f1, axis="columns")

Utah      0.117987
Ohio      1.456644
Texas     0.366024
Oregon    2.412937
dtype: float64

In [222]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [223]:
frame.apply(f2)

            b         d         e
min -1.205084 -1.547119 -0.831480
max -0.174682 -0.038659  1.207853

In [224]:
def my_format(x):
    return f"{x:.2f}"

In [225]:
frame.applymap(my_format)

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\2069332265.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -0.77  -0.89  -0.83
Ohio    -0.17  -1.55  -0.09
Texas   -0.38  -0.04  -0.40
Oregon  -1.21  -0.18   1.21

In [226]:
frame["e"].map(my_format)

Utah      -0.83
Ohio      -0.09
Texas     -0.40
Oregon     1.21
Name: e, dtype: object

### Ordenação e classificação

In [227]:
# Método sort_index
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [ ]:
obj

d    0
a    1
b    2
c    3
dtype: int32

In [229]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [230]:
frame = pd.DataFrame(
    np.arange(8).reshape((2, 4)),
    index=["three", "one"],
    columns=["d", "a", "b", "c"],
)

In [ ]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [ ]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [233]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [234]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [235]:
obj = pd.Series([4, 7, -3, 2])

In [ ]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [ ]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [238]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [239]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [240]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [ ]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [242]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [243]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [ ]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [ ]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [246]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [247]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [248]:
frame = pd.DataFrame(
    {"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]}
)

In [ ]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [250]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Índices de eixos com rótulos duplicados

In [251]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [ ]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [ ]:
obj.index.is_unique

False

In [254]:
obj["a"]

a    0
a    1
dtype: int32

In [255]:
obj["c"]

4

In [256]:
df = pd.DataFrame(
    np.random.standard_normal((5, 3)), index=["a", "a", "b", "b", "c"]
)

In [ ]:
df

          0         1         2
a -0.687186 -1.478904 -2.189455
a -0.571572 -0.247510 -0.147588
b  0.752800 -1.761333 -2.275843
b -1.742834  0.617438  0.508168
c  0.304670  0.660280  0.306653

In [258]:
df.loc["b"]

          0         1         2
b  0.752800 -1.761333 -2.275843
b -1.742834  0.617438  0.508168

In [ ]:
df.loc["c"]

0    0.304670
1    0.660280
2    0.306653
Name: c, dtype: float64

## 5.3 Síntese e cálculo de estatísticas descritivas

In [283]:
df = pd.DataFrame(
    [[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
    index=["a", "b", "c", "d"],
    columns=["one", "two"],
)

In [284]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [285]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [286]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [287]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [288]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [289]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [290]:
df.idxmax()

one    b
two    d
dtype: object

In [291]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [292]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [293]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [294]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlação e Covariância

In [295]:
price = pd.read_pickle("examples/yahoo_price.pkl")

In [296]:
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [297]:
returns = price.pct_change()

In [298]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [299]:
returns["MSFT"].corr(returns["IBM"])

0.49976361144151155

In [300]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [301]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [302]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [303]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [304]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

### Valores únicos, contagens de valores e pertencimento

In [305]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [ ]:
uniques = obj.unique()

In [ ]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [ ]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [309]:
pd.value_counts(obj.to_numpy(), sort=False)

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\3058311977.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [ ]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [311]:
mask = obj.isin(["b", "c"])

In [ ]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [313]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [314]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [315]:
unique_vals = pd.Series(["c", "b", "a"])

In [316]:
indices = pd.Index(unique_vals).get_indexer(to_match)

In [ ]:
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [318]:
data = pd.DataFrame(
    {"Qu1": [1, 3, 4, 3, 4], "Qu2": [2, 3, 1, 2, 3], "Qu3": [1, 5, 2, 4, 4]}
)

In [ ]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [320]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [321]:
result = data.apply(pd.value_counts).fillna(0)

C:\Users\derek\AppData\Local\Temp\ipykernel_18428\1318964110.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [ ]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [323]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [ ]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [ ]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64